<?php
/**
 * 入库0-20
 * 入库51-80
 */
return array(
    '0' => '其他入库',
    '1' => '采购收货',
    '2' => '生产收货',
    '3' => '加工退回',
    '4' => '销售退货',
    '5' => '合卷入库',
    '6' => '分卷入库',
    '7' => '疵品入库',
    // 8  故意留空
    '9' => '仓库期初',
    '10' => '委外入库',
    '11' => '委外退回',
    '12' => '盘盈入库',
    '13' => '调拨入库',
    '14' => '车间向WMS领料',
    '15' => '车间向线边仓领料',
    '16' => '报工入库',
    '17' => '签转入库',
    '18' => '车间退料',
    '19' => '车间向WMS补料',
    '20' => '委外车间退料',
    '51' => '车间定额入库',
    '52' => '车间补料入库',
    '53' => '车间退料入库',

);