<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [


    /*
     |--------------------------------------------------
     |物料分类
     |----------------------------------------------------
     |@author sam.shan  <sam.shan@ruis-ims.cn>
     */

    //'1000'=>'物料分类名称不可以为空',
    '1001'=>'物料分类名称已经注册过',
    //'1002'=>'物料分类代码不可以为空',
    //'1003'=>'物料分类代码格式错误(1-10个大写字母组成)',
    //'1004'=>'物料分类描述字数不可以超过500个字符',
    //'1005'=>'物料分类代码已经注册过',
    //'1006'=>'请选择物料来源',
    //'1007'=>'请选择物料模板',
    '1008'=>'该上级分类已经在物料中使用!不可增加下级!',
    '1009'=>'此物料分类已经在物料中使用!不可删除!',




];