<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [
    /**
     * 物料编码
     */
    '100'=>'流水号长度必须大于0',
    '101'=>'流水号起始值不能小于0',
    '102'=>'流水号步长必须大于0',
    '103'=>'automatic_number参数格式错误',
    '104'=>'尚未设置编码规则',

    '105'=>'数量区间值错误',
    '106'=>'倍数设置错误',

    '110'=>'工序编码已存在',
    '111'=>'工序不存在',
    '112'=>'物料分类不存在',
    '113'=>'工序与物料已关联',
    '114'=>'物料不存在',
    '115'=>'请输入正确的间隔时间',
    '116'=>'维护关系已存在',
    '117'=>'关系类型不正确',
    '118'=>'维护关系不存在',
    '119'=>'该工序下存在维护关系',
    '120'=>'该工序下存在工时',
    '121'=>'流水号长度已超过设置长度，请重新设置编码规则',
    '122'=>'物料编码已被占用，请重新保存',

    '123'=>'能力名字已被占用',
    '124'=>'能力编码已被占用',
    '125'=>'能力编码不存在',
    '126'=>'能力id已被占用',
    '127'=>'能力id不存在',
    '128'=>'能力(id/code)不存在',
    '129'=>'当前能力已被工序关联，请先解绑再删除',
    '130'=>'当前工序已被物料分类使用，无法删除',

    '140'=>'编码已存在',
    '141'=>'工艺顺序冲突',
    '142'=>'工艺id异常',
    '143'=>'工艺路线id异常',
    '149'=>'该默认节点不能删除',

    '160'=>'上级分类不存在',
    '161'=>'存在子分类无法删除',
    '162'=>'必须选择基准能力！',
    '163'=>'倍数不能为空！',

    '171'=>'已被工艺路线使用',
];