<?php
/**
 * Created by PhpStorm.
 * User: haoziye
 * Date: 2018/1/12
 * Time: 下午4:24
 */

return [

    '1102'=>'使用中，无法删除',
    '1103'=>'编码已被使用',
    '1104'=>'编码格式不对',
    '1105'=>'名称已被使用',
    '1107'=>'编码设置有误，请联系管理员',

    /*
     |--------------------------------------------------
     |图纸库
     |----------------------------------------------------
     |@author hao.wei  <weihao>
     */

    '1101'=>'不被允许的文件',
    '1106'=>'存在同名且相同属性的图纸',
    '1108'=>'图纸不能关联自己',
    '1109'=>'所关联的图纸不存在',
    '1110'=>'所关联的附件不存在',
    '1111'=>'所选的图纸分类有不存在的',
    '1112'=>'图纸不存在，请重新上传',
    '1113'=>'图纸文件不存在',
    '1114'=>'图纸被做法使用中，无法删除',
    '1115'=>'图纸已添加，请从图纸列表查看/编辑',
    '1116'=>'图纸记录不存在',
    '1117'=>'不允许上传PHP脚本文件',
    '1119'=>'数据不能为空',

    /*
     |--------------------------------------------------
     |bom工艺路线管理
     |----------------------------------------------------
     |@author hao.wei  <weihao>
     */
    '1131'=>'开始步骤不存在',
    '1132'=>'做法不存在',
    '1133'=>'工艺路线节点不存在',
    '1134'=>'结束步骤不存在',
    '1135'=>'工序不存在',
    '1136'=>'bom不存在',
    '1137'=>'该做法关联的物料分类没有默认单位',
    '1138'=>'物料不存在',
    '1139'=>'工艺路线不存在',
    '1140'=>'步骤不存在',
    '1141'=>'图纸不存在',
    '1142'=>'物料分类不存在',
    '1143'=>'附件不存在',
    '1144'=>'该做法用处拥有下一级，无法删除',
    '1145'=>'被替换的工艺路线不存在',
    '1146'=>'当前工艺路线已被同步过，不需要替换其他工艺路线',
    '1147'=>'不是发布版本，无法替换',
    '1148'=>'不同工厂的工艺路线不能替换',
    '1149'=>'被替换的工艺路线未同步过，没有组号和组计数器，无法被替换',
    /*
     |--------------------------------------------------
     |工厂管理
     |----------------------------------------------------
     |@author hao.wei  <weihao>
     */
    '1151'=>'该公司不存在',
    '1152'=>'该工厂不存在',
    '1153'=>'该国家不存在',

    '1155'=>'该车间不存在',
    '1156'=>'该班次不存在',
    '1157'=>'该工作中心不存在',
    '1158'=>'员工不存在或已离职，请重新选择',
    '1159'=>'该工作台不存在',

    '1161'=>'休息时间不能设置在工作时间之外',
    '1162'=>'班次时间有冲突',
    '1163'=>'时间设置错误',
    '1164'=>'该班次已和工作台绑定，暂无法删除，请先解除绑定',
    '1165'=>'班次类型不存在',
    '1166'=>'该班次类型已在班次中使用，无法删除',
    '1167'=>'有不存在的工序',
    '1168'=>'有不存在的步骤',
    '1169'=>'有不存在的工艺路线',

    /*
     |--------------------------------------------------
     |销售管理
     |----------------------------------------------------
     |@author hao.wei  <weihao>
     */
    '1181'=>'手机格式不正确',
    '1182'=>'该客户信息已被销售订单使用，无法删除',
    '1183'=>'客户不存在',

    /*
     |--------------------------------------------------
     |产品细分类
     |----------------------------------------------------
     |@author lesteryou
     */
    '1190'=>'当前分类拥有子分类，无法删除',
];