<?php


return [

    /*
    |--------------------------------------------------
    |员工档案导入excel相关的错误码
    |----------------------------------------------------
    |@author Bruce.Chu
    */

    '2000'=>'请按指定模板上传且表格主体内容不为空',
    '2001'=>'无新员工需导入',
    '2002'=>'请按指定模板格式上传表格',

    /*
    |--------------------------------------------------
    |工艺路线组相关的错误码
    |----------------------------------------------------
    |@author Bruce.Chu
    */

    '2003'=>'该组下有工艺路线正在使用,不可删除',
    '2004'=>'该组在该厂下有工艺路线正在使用,不可删除',
];