<?php
/**
 * Created by PhpStorm.
 * User: ruiyanchao
 * Date: 2017/12/19
 * Time: 下午1:34
 */

return [
    //BOM管理
    '2100'=>'物料清单名称已经注册过了',
    '2101'=>'物料清单编码已经注册过了',
    '2102'=>'该物料已经存在BOM结构',
    '2103'=>'此BOM分组已经在BOM中使用!不可删除!',
    '2104'=>'物料清单分组编码已经注册过了',
    '2105'=>'物料清单分组名称已经注册过了',
    '2106'=>'该bom已被其他bom作为子项使用！不可删除！',
    '2107'=>'该bom已存在多版本！不可删除！',
    '2108'=>'非法请求',
    '2109'=>'非法请求',
    '2110'=>'BOM树结构异常,原因是不存在BOM结构的子项有了BOM结构,解决方案是请同步相关数据',
    '2111'=>'拉取BOM失败',
    '2112'=>'未找到相关BOM',
];