<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [



    //物料模板类型
//    '4000'=>'模板类型键值不可以为空',
//    '4001'=>'键值由3-50位字母下划线数字组成,且字母开头',
//    '4002'=>'模板类型名称不可以为空',
//    '4003'=>'模板类型描述字数不可以超过500个字符',
    '4004'=>'该属性键值已经注册过了',
    '4005'=>'该属性名称已经注册过了',
//    '4006'=>'移除的属性有些正在被使用',
//    '4007'=>'返回的物料分组是无效的',

    '4008'=>'此属性已经在物料模板中使用!不可删除!',
    '4009'=>'此属性已经在物料中使用!不可删除!',

    '4010'=>'不可以移除已经在物料中使用的物料属性!',
    '4011'=>'不可以移除被其它物料模板继承的物料属性!',
    '4012'=>'不可以将被其它物料模板继承的物料属性修改为非继承!',
    '4013'=>'不可以将被其物料使用过的物料属性修改为非继承!',




];