<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [




    //物料模板
    //'5000'=>'物料模板代码不可以为空',
    //'5001'=>'物料模板代码格式错误(由1-10位大写字母组成)',
    // '5002'=>'没有传入operation_id',
    // '5002'=>'模板已经与该工序进行了绑定',
    // '5003'=>'不存在该工序id',
    // '5004'=>'不存在该自定义参数的id',
    // '5005'=>'模板已经与该自定义参数进行了绑定',
    //'5006'=>'不存在该模板',
    //'5007'=>'数据库表中不存在该id',
//    '5008'=>'请选择物料模板类型',
//    '5009'=>'物料模板描述不可以超过500个字符',
//    '5010'=>'物料模板名称不可以为空',
    '5011'=>'物料模板编码已经注册过了',
    '5012'=>'物料模板名称已经注册过了',
    //'5013'=>'保存自动编码失败',
    //'5014'=>'保存属性过滤值失败',
    '5015'=>'此物料模板已经被其它物料模板继承使用!不可删除!',
    '5016' => '模板不存在',
    '5017' => '属性数据不完善，该模板无法生效',
    '5018'=>'此物料模板已经在物料中使用!不可删除!',


];