<?php
/**
 * Created by PhpStorm.
 * User: wangguangyang
 * Date: 2018/1/30
 * Time: 13:14
 */
return [
  '6200' => '该订单没有完结！',

    //QC plan
	'6201'  => '编号格式错误(1-10个大写字母组成)',
	'6202'  => '编号不可以为空',
	'6203'  => '描述字数不可以超过500个字符',
	'6204'  => '编号已经注册过',
    '6211'  => '请检查是否存在page_no、page_size',
    '6212' => '类型名称已经注册过',
    '6213' => '类型编号已经注册过',
    '6214' => '超过一种模板无法进行批量检验',
    '6215' => '检验单已检验或已推送不能修改',
    '6216' => '检验单还未检验结果',
    '6217' => '检验结果已推送不需要再次检验',
    '6218' => '检验种类不能重复定义',
    '6219' => 'iqc 检验不能  直接关联 工序',
    '6220' => 'ipqc 检验不能  直接关联 物料',
    '6221' => 'oqc 检验不能  直接关联 工序',
    '6222' => '不合格的产品，需要先审核再推送',
    '6223' => '检验单已审核！不需要再次审核',
    '6224' => '检验单未审核！不需要再次反审',
    '6225' => '单据已经推送！',
    '6226' => '单据未检验！',
];