<?php
/**
 * Created by PhpStorm.
 * User: wangguangyang
 * Date: 2018/2/7
 * Time: 14:50
 */
return [

    '6500' => '检验类型不能为空！',
    '6501' => '检验项不能为空！',
    '6502' => '该检验项已在这个模板！',
    '6503' => '插入失败！',
    '6504' => '删除失败！',
    '6505' => '列表为空！',
    '6506' => '未查到该类！',
    '6507' => '查找失败！',
    '6508' => '检验项编码格式错误（1-10个大写字母组成）',
    '6509' => '检验项名称不可以为空',
    '6510' => '检验项名称已经注册过',
    '6511' => '检验项编号已经注册过',
    '6512' => '存在子项',
    '6513' => '存在未设置检验模板的检验单',
    '6514' => '请选择检验单',
    '6515' => '有多种检验模板',
    '6516' => '请先选着上级检验项',
    '6517' => '存在重复检验类别，请仔细检查',
    '6518' => '不存在该物料',
    '6519' => '找不到合适的检验模板',
    '6520' => '该分类下存在子集请先删除子集',
    '6521' => '不存在工序！',
    '6522' => '不存在检验模板！',
    '6523' => '检验模板发生过改变！',
    '6524' => '不存在物料编号请检查报文！',
    '6525' => '缺少检验类型！',
    '6526' => '模板CODE已存在！',
];