<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [


    //物料管理

    '7000'=>'物料名称已经注册过了',
    '7001'=>'物料编码已经注册过了',
    '7002' => '当前系统中已经存在相同物料属性配置的物料',
    '7003'=>'该物料已经作为BOM顶级母件使用中!不可删除!',
    '7004'=>'该物料已经作为BOM子项使用中!不可删除!',
    '7005'=>'该物料已经作为BOM工艺路线进出料使用中!不可删除!',




    '7028'=>'上传附件失败',

    '7029'=>'上传excel失败',



    //ERP
    '7070'=>'物料code已添加或数据异常',
    '7071'=>'非BOM物料',
    '7072'=>'BOM结构缺失',
    '7073'=>'产品物料信息缺失',
    '7074'=>'尚未拉取该ERP物料',
    '7075'=>'该ERP物料附件已入库',
    '7076'=>'该物料不存在任何附件',
];