<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [

/*
|--------------------------------------------------
|数据库有关的错误代码
|----------------------------------------------------
|@author sam.shan  <sam.shan@ruis-ims.cn>
*/
    '800'=>'数据库连接信息错误',
    '801'=>'数据库连接超时',
    '802'=>'网络故障,添加失败',
    '803'=>'网络故障,删除失败',
    '804'=>'网络故障,更新失败',
    '805'=>'无效的操作',//更新的内容未做任何改变 [亦或] 要更新的记录不存在Query OK, 0 rows affected
    '806'=>'网络故障,保存失败',//当涉及到添加和编辑是相同的方法的时候
    //erp接口向mes数据库插入数据时可能出现的错误
    '807'=>'该生产订单已入库,不可重复拉取',
    '808'=>'该物料或BOM已入库,不可重复拉取',
    '809'=>'拆分工单的数量不能大于或者等于原工单数量',

];