<?php 
/**
 *8000-9000  为仓库的所有错误编码
 *8000-8300  为仓库基础设置错误编码
 *8300-8999  为仓库业务设置错误编码
 */

return [
    //其他入库单
    '8301' => '其他入库单编号不可以为空！',
    '8302' => '其他入库单编号格式错误(1-10个大写字母组成)！',
    '8303' => '其他入库单备注字数不可以超过500个字符',
    '8304' => '其他入库单明细不能为空',

    '8305' => '入库单编号已经被占用',
    '8306' => '单据已审核，审核失败！',
    '8307' => '单据未审核，反审失败！',
    '8308' => '单据已审核，修改失败！',
    '8309' => '明细不能为空审核失败！',
    '8310' => '单据已审核，不可修改！',
    '8311' => '单据已审核，不可删除！',
    '8312' => '请检查是否存在page_no、page_size',
];
