<?php 
// 工时  workhour

return [
    '9000' => '最大值、最小值区间设置有重叠！',
    '9001' => '添加失败，数据有误！',
    '9002' => '请先清空相关工时设置！',
    '9003' => '工序不能为空！',
    '9004' => '不存在该物料编码！',
    '9005' => '请先在工时设置里面先维护该工序是否按区间维护！',
    '9006' => '缺少工艺步骤id',
    '9007' => '缺少工序id',
    '9008' => '工时明细不能为空！',
    '9009' => '工艺路线id 不能为空！',
    '9010' => '缺少能力!',
    '9011' => '该工序下 不存在该能力！',
    '9012' => '请先前往工序设置，维护该工序是否按区间维护工时！',
    '9013' => 'bom_id 不能为空！',
    '9014' => '最小值不能大于最大值！',
    '9015' => '该步骤不存在相关工时信息！',
    '9016' => '该步骤下不存在该工序相关工时信息！',
    '9017' => '该步骤、该工序下不存该能力相关工时信息！',
    '9018' => '该步骤不存在相关工时设置信息！',
    '9019' => '该步骤下不存在该工序相关工时设置信息！',
    '9020' => '该步骤、该工序下不存该能力相关工时设置信息！',
    '9021' => '不存在该工时设置！',
    '9022' => '存在重复区间设置！',
    '9023' => '请维护单次切割时间！',
    '9024' => '请检查工艺路线！',
    '9025' => '请检查基础数量！',
    '9026' => '请维护该BOM的工时区间！',
    '9027' => '不存在该bom ID!',


];