<?php
/**
 * Created by PhpStorm.
 * User: sansheng
 * Date: 17/11/21
 * Time: 下午5:02
 */


return [


    /*
     |--------------------------------------------------
     |系统业务层公共错误代码
     |----------------------------------------------------
     |@author sam.shan  <sam.shan@ruis-ims.cn>
     */
    '903'=>'您的选择有误(禁止选择自身或者子分类作为自己的上级分类)',
    '904'=>'有下级分类,不可删除!',
    '905'=>'参数不是数组或空！',
    '906'=>'验证码失效或者错误',
    '907'=>'用户名或者密码错误',
    '908'=>'用户已经被超级管理员禁用!',
    '909'=>'Login too frequently today,please contact your administrator',//账号是否频繁登陆
    '910'=>'this IP Login too frequently today,please contact your administrator',//验证ip今天是否频繁登录
    '911'=>'Login too frequently please try it later or contact your administrator',////每分钟登陆错误次数检查
    '912'=>'系统异常登陆失败',
    '913'=>'节点名称已经注册过了',
    '914'=>'权限节点已经注册过了',
    '915'=>'权限节点已经被使用,禁止删除',
    '916'=>'权限节点标识禁止修改',
    '917'=>'角色名称已经注册过了',
    '918'=>'角色已经被使用,禁止删除',
    '919'=>'该账户已经注册过了',
    '920'=>'该手机号已经注册过了',
    '921'=>'该邮箱已经注册过了',
    '922'=>'菜单名称已经注册过了',
    '933'=>'此菜单已经在权限节点中使用!不可删除!',
    '934'=>'菜单初始化失败',
    '935'=>'当前客户端已存在登陆用户,请先退出再登陆!',
    '936'=>'修改密码失败',
    '937'=>'原密码错误',
    '938'=>'修改个人信息失败',



];